src/Documents/ТранспортнаяЛогистика/ТранспортнаяЛогистика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТранспортнаяЛогистика</name>
  <registerRecords>AccumulationRegister.ТранспортнаяЛогистикаЗаказы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Маршруты</name>
    <attributes>
      <name>Маршрут</name>
      <type>
        <types>CatalogRef.Маршруты</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.Водители</types>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль</name>
      <type>
        <types>CatalogRef.Автомобили</types>
      </type>
    </attributes>
    <attributes>
      <name>Тоннаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пробег</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Рейсы</name>
    <attributes>
      <name>Маршрут</name>
      <type>
        <types>CatalogRef.Маршруты</types>
      </type>
    </attributes>
    <attributes>
      <name>Рейс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тоннаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пробег</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставыРейсов</name>
    <attributes>
      <name>Маршрут</name>
      <type>
        <types>CatalogRef.Маршруты</types>
      </type>
    </attributes>
    <attributes>
      <name>Рейс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерВРейсе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаМаршрута</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресJSON</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тоннаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыМаршрута</name>
    <attributes>
      <name>GUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.Доверенность</types>
        <types>DocumentRef.СчетНаОплатуПокупателю</types>
      </type>
    </attributes>
    <attributes>
      <name>Тоннаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ТранспортнаяЛогистикаЗаказы/ТранспортнаяЛогистикаЗаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТранспортнаяЛогистикаЗаказы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Тоннаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Наценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>АдресПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЛогистикиНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЛогистикиОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.Маршруты</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВРейсе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.Доверенность</types>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ТранспортнаяЛогистика/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТранспортнаяЛогистикаСоставыРейсов.Ссылка.Организация КАК Организация,
	|	ТранспортнаяЛогистикаДокументыМаршрута.Документ КАК ДокументДвижения,
	|	ВЫБОР
	|		КОГДА ТранспортнаяЛогистикаДокументыМаршрута.Документ.Грузоотправитель <> ТранспортнаяЛогистикаДокументыМаршрута.Документ.Организация
	|				И ТранспортнаяЛогистикаДокументыМаршрута.Документ.Грузоотправитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ТранспортнаяЛогистикаДокументыМаршрута.Документ.Грузоотправитель <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ТранспортнаяЛогистикаДокументыМаршрута.Документ.Грузоотправитель
	|		ИНАЧЕ ТранспортнаяЛогистикаДокументыМаршрута.Документ.Организация
	|	КОНЕЦ КАК Грузоотправитель,
	|	ТранспортнаяЛогистикаСоставыРейсов.ТочкаМаршрута КАК Грузополучатель,
	|	ТранспортнаяЛогистикаСоставыРейсов.АдресПредставление КАК АдресПредставление,
	|	ТранспортнаяЛогистикаСоставыРейсов.ВремяНачала КАК ВремяЛогистикиНачало,
	|	ТранспортнаяЛогистикаСоставыРейсов.ВремяОкончания КАК ВремяЛогистикиОкончание,
	|	ТранспортнаяЛогистикаСоставыРейсов.Маршрут КАК Маршрут,
	|	ТранспортнаяЛогистикаМаршруты.Водитель КАК Водитель,
	|	ТранспортнаяЛогистикаМаршруты.Автомобиль КАК Автомобиль,
	|	ТранспортнаяЛогистикаСоставыРейсов.Рейс КАК Рейс,
	|	ТранспортнаяЛогистикаСоставыРейсов.НомерВРейсе КАК НомерВРейсе,
	|	ТранспортнаяЛогистикаМаршруты.Пробег КАК Пробег
	|ИЗ
	|	Документ.ТранспортнаяЛогистика.СоставыРейсов КАК ТранспортнаяЛогистикаСоставыРейсов
	|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.ТранспортнаяЛогистика.Маршруты КАК ТранспортнаяЛогистикаМаршруты
	|		ПО ТранспортнаяЛогистикаСоставыРейсов.Маршрут = ТранспортнаяЛогистикаМаршруты.Маршрут
	|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.ТранспортнаяЛогистика.ДокументыМаршрута КАК ТранспортнаяЛогистикаДокументыМаршрута
	|		ПО ТранспортнаяЛогистикаСоставыРейсов.GUID = ТранспортнаяЛогистикаДокументыМаршрута.GUID
	|ГДЕ
	|	ТранспортнаяЛогистикаДокументыМаршрута.Ссылка = &Ссылка
	|	И ТранспортнаяЛогистикаМаршруты.Ссылка = &Ссылка
	|	И ТранспортнаяЛогистикаСоставыРейсов.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТранспортнаяЛогистикаСоставыРейсов.Маршрут,
	|	ТранспортнаяЛогистикаСоставыРейсов.Рейс,
	|	ТранспортнаяЛогистикаСоставыРейсов.НомерВРейсе,
	|	ТранспортнаяЛогистикаСоставыРейсов.АдресПредставление,
	|	ТранспортнаяЛогистикаСоставыРейсов.ВремяНачала,
	|	ТранспортнаяЛогистикаСоставыРейсов.ВремяОкончания,
	|	ТранспортнаяЛогистикаСоставыРейсов.Ссылка.Организация,
	|	ТранспортнаяЛогистикаДокументыМаршрута.Документ,
	|	ВЫБОР
	|		КОГДА ТранспортнаяЛогистикаДокументыМаршрута.Документ.Грузоотправитель <> ТранспортнаяЛогистикаДокументыМаршрута.Документ.Организация
	|				И ТранспортнаяЛогистикаДокументыМаршрута.Документ.Грузоотправитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ТранспортнаяЛогистикаДокументыМаршрута.Документ.Грузоотправитель <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ТранспортнаяЛогистикаДокументыМаршрута.Документ.Грузоотправитель
	|		ИНАЧЕ ТранспортнаяЛогистикаДокументыМаршрута.Документ.Организация
	|	КОНЕЦ,
	|	ТранспортнаяЛогистикаСоставыРейсов.ТочкаМаршрута,
	|	ТранспортнаяЛогистикаМаршруты.Водитель,
	|	ТранспортнаяЛогистикаМаршруты.Автомобиль,
	|	ТранспортнаяЛогистикаМаршруты.Пробег";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() тогда
		
		ДвиженияТранспортнаяЛогистикаЗаказы = Движения.ТранспортнаяЛогистикаЗаказы;
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Для Каждого СтрокаТовары из Выборка.ДокументДвижения.Товары цикл
			
				НовоеДвижение = ДвиженияТранспортнаяЛогистикаЗаказы.Добавить();
				
				ЗаполнитьЗначенияСвойств(НовоеДвижение, Выборка);
				
				НовоеДвижение.Период = Дата;
				НовоеДвижение.Регистратор = Ссылка;
				НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Расход;
				НовоеДвижение.Номенклатура = СтрокаТовары.Номенклатура;
				НовоеДвижение.Количество = СтрокаТовары.Количество;
				НовоеДвижение.Тоннаж = СтрокаТовары.Номенклатура.ВесЕдиницы * СтрокаТовары.Количество;
				НовоеДвижение.Наценка = СтрокаТовары.Наценка;
				НовоеДвижение.НомерВРейсе = Выборка.НомерВРейсе;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ДвиженияТранспортнаяЛогистикаЗаказы.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Заполнение даты документа
	ФиксированноеВремяДокументов.УстановитьВремяНовогоДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры
